Library_back_dsiva/app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-09-24 04:52:29.263813"], ["updated_at", "2016-09-24 04:52:29.263813"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save