Library_back_dsiva/app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("number", "size", "library_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 1], ["size", "Medium"], ["library_id", 1], ["created_at", "2016-09-24 04:30:16.446819"], ["updated_at", "2016-09-24 04:30:16.446819"]]