Library_back_dsiva/app/views/rooms/_form.html.erb

    <%= f.label :library %>
    <%= select("room", "library_id", Library.all.collect{ |c| [c.name, c.id]}) %>
---
SELECT "libraries".* FROM "libraries"